In [1]:
import pandas as pd
import numpy as np

## Series

In [2]:
s =  pd.Series([7, 15, 4, 4, 7, 4], index=['r1','r2','r3','r4','r5','r6'])
s

r1     7
r2    15
r3     4
r4     4
r5     7
r6     4
dtype: int64

In [3]:
s.r1

7

In [4]:
s[0]

7

In [5]:
s.values

array([ 7, 15,  4,  4,  7,  4], dtype=int64)

In [6]:
s.index

Index(['r1', 'r2', 'r3', 'r4', 'r5', 'r6'], dtype='object')

In [7]:
s.value_counts()

4     3
7     2
15    1
dtype: int64

## DataFrame

In [8]:
df =  pd.DataFrame([[1,8],
                    [3,4],
                    [5,9],
                    [7,2],
                    [2,6]], 
                  index=['R1','R2','R3','R4','R5'],
                  columns=['C1','C2'])

In [9]:
df

    C1  C2
R1   1   8
R2   3   4
R3   5   9
R4   7   2
R5   2   6

In [10]:
df.describe()

             C1        C2
count  5.000000  5.000000
mean   3.600000  5.800000
std    2.408319  2.863564
min    1.000000  2.000000
25%    2.000000  4.000000
50%    3.000000  6.000000
75%    5.000000  8.000000
max    7.000000  9.000000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, R1 to R5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C1      5 non-null      int64
 1   C2      5 non-null      int64
dtypes: int64(2)
memory usage: 120.0+ bytes

In [12]:
df.head(3)

    C1  C2
R1   1   8
R2   3   4
R3   5   9

In [13]:
df.tail(3)

    C1  C2
R3   5   9
R4   7   2
R5   2   6

In [14]:
df[:3]

    C1  C2
R1   1   8
R2   3   4
R3   5   9

In [15]:
df.iloc[2,1]

9

In [16]:
df.values

array([[1, 8],
       [3, 4],
       [5, 9],
       [7, 2],
       [2, 6]], dtype=int64)

In [17]:
df.index

Index(['R1', 'R2', 'R3', 'R4', 'R5'], dtype='object')

In [18]:
df.columns

Index(['C1', 'C2'], dtype='object')

In [19]:
df[df<5]

     C1   C2
R1  1.0  NaN
R2  3.0  4.0
R3  NaN  NaN
R4  NaN  2.0
R5  2.0  NaN

In [20]:
df.T

    R1  R2  R3  R4  R5
C1   1   3   5   7   2
C2   8   4   9   2   6

In [21]:
df

    C1  C2
R1   1   8
R2   3   4
R3   5   9
R4   7   2
R5   2   6

In [22]:
df.drop('R3', axis=0)

    C1  C2
R1   1   8
R2   3   4
R4   7   2
R5   2   6

In [23]:
df.drop('C2', axis=1)

    C1
R1   1
R2   3
R3   5
R4   7
R5   2

In [24]:
df

    C1  C2
R1   1   8
R2   3   4
R3   5   9
R4   7   2
R5   2   6

## Other examples

In [28]:
df = pd.DataFrame({'x1':[1,2], 'x2':[3,4], 'x3':[5,6]})
df

   x1  x2  x3
0   1   3   5
1   2   4   6

In [29]:
data = {'Name':['Mike','Daniel','Anna','Sara','James'],
        'Location':['Montreal','Laval','Montreal','Brossard','Laval'],
        'Age':[22,33,44,55,66]}

df = pd.DataFrame(data)
df

     Name  Location  Age
0    Mike  Montreal   22
1  Daniel     Laval   33
2    Anna  Montreal   44
3    Sara  Brossard   55
4   James     Laval   66

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Location  5 non-null      object
 2   Age       5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [31]:
df.describe()

             Age
count   5.000000
mean   44.000000
std    17.392527
min    22.000000
25%    33.000000
50%    44.000000
75%    55.000000
max    66.000000

In [32]:
df.sort_index(axis=1)

   Age  Location    Name
0   22  Montreal    Mike
1   33     Laval  Daniel
2   44  Montreal    Anna
3   55  Brossard    Sara
4   66     Laval   James

In [35]:
df.sort_values(by='Age', ascending=False)

     Name  Location  Age
4   James     Laval   66
3    Sara  Brossard   55
2    Anna  Montreal   44
1  Daniel     Laval   33
0    Mike  Montreal   22

In [36]:
df[df.Age < 40]

     Name  Location  Age
0    Mike  Montreal   22
1  Daniel     Laval   33

In [37]:
df

     Name  Location  Age
0    Mike  Montreal   22
1  Daniel     Laval   33
2    Anna  Montreal   44
3    Sara  Brossard   55
4   James     Laval   66

In [38]:
df.iloc[0][0]

'Mike'

In [39]:
df.iloc[0]['Name']

'Mike'

In [40]:
df.Location

0    Montreal
1       Laval
2    Montreal
3    Brossard
4       Laval
Name: Location, dtype: object

In [41]:
df.Name

0      Mike
1    Daniel
2      Anna
3      Sara
4     James
Name: Name, dtype: object

In [42]:
df.Age

0    22
1    33
2    44
3    55
4    66
Name: Age, dtype: int64

In [45]:
df =  pd.DataFrame(np.random.randn(50,7))

In [46]:
df

           0         1         2         3         4         5         6
0  -0.102776 -0.918924  0.276567 -0.558351  1.155147  0.860235  0.518951
1   0.058367  0.344438 -0.963842 -2.338285  1.266982 -1.496682 -0.825698
2  -0.900878  0.489925 -0.497601 -0.124297  0.990624  2.944979  1.555461
3   0.151219  2.022263  0.758591  1.635999 -0.915156  1.032121 -0.357196
4  -1.052571 -0.958884 -0.595212  1.428770  0.460333 -0.234220 -1.156503
5  -0.508235  0.804234  0.336801 -1.416143  0.101719 -0.252829 -0.721623
6  -0.078430  0.992247 -0.202874  1.221874  0.246945 -0.143940  1.336075
7  -0.108576 -1.873176  0.214215  0.605051  0.375698  0.275249 -0.055771
8  -1.998228 -0.626069  2.715554  0.704580  0.237671 -0.242714 -0.397701
9   0.219667 -1.124516  0.419686  0.803135 -0.481916  0.730412  0.021362
10 -1.690455 -0.599153  1.008304  2.091609  0.425846  1.425239 -0.796178
11  1.493456 -0.227440 -1.511290 -0.124205 -0.780590 -0.660388 -1.523619
12  0.002142 -0.636576 -0.497367 -0.390717 -0.423597 -1.491108  0.233559
13  0.337183  0.693264  0.644256  0.033175  0.062857 -0.359001  3.064439
14 -0.510699  0.153467 -0.863545  1.586609  0.477495  0.092391  0.332679
15  0.504041  1.318623 -2.667843 -0.284036 -0.548333 -0.980853 -0.124159
16 -0.679532  0.428614  1.744577 -0.883692  0.418624  1.020493  0.844290
17  0.554456  1.734399 -0.245758 -0.698152 -1.053692 -2.214247  0.230229
18  0.427882  0.557684  0.265613  0.297281  0.711745  1.104053 -0.224044
19 -0.305469  1.620476  0.740366 -2.746891 -0.390326 -0.670620 -0.100091
20  0.383497  0.224287 -1.089605 -0.733935 -0.319862 -1.730269 -1.172730
21  1.268645  0.420149 -0.736306 -1.678726  0.890450 -0.083026  0.236908
22  1.356701  0.951055  0.460551 -0.502401 -0.443117  0.174705 -1.332373
23 -0.368085  1.498764  1.253394 -0.030341 -1.854401  0.140436  1.631292
24  1.202889  1.008179 -0.216480  1.949005 -0.609770 -1.511167  2.719999
25  1.057025  0.200199  0.184952 -0.586678  1.123921 -0.993636  1.077071
26 -0.107143  1.795761  1.036455  1.257232  0.391197  1.063596  0.092795
27  0.541154  1.670430  0.064614 -0.442769  0.610159 -1.151729  0.746923
28  1.706749 -0.957704  1.120859  1.664741  0.029474 -1.583221  0.311803
29 -0.019801  0.178600  0.454676  0.609223 -0.047592 -1.826774 -1.879635
30 -0.115307  0.127701 -0.966253  1.358217  0.011267 -0.249398  1.110018
31 -0.105601  0.828257  0.272544  0.012267 -2.608760  0.417566 -0.563791
32  0.254480  1.047492 -0.281874 -0.061290  0.094831 -0.823588 -0.583948
33  0.332179 -0.365317 -0.828013  0.167304 -0.002559 -0.454199  0.288382
34 -0.855715 -0.715763  0.567394  1.491271 -0.763291 -0.665514 -0.751547
35  0.250469 -1.638443 -1.511152 -2.027671 -0.294831  0.907551  1.513641
36  0.142675  0.618303 -0.093716  0.890126  0.620605 -0.103898 -0.159103
37  0.836201  0.556106 -0.050629 -1.317923 -0.792161  0.992417  0.258476
38 -1.207631  0.233790 -0.198936 -0.594341  1.279972 -1.897843  0.578163
39 -1.923594  1.273381 -0.733344  1.278997 -0.705547  0.347760 -0.136436
40 -1.026599  2.256926 -0.003681 -0.657842  0.537589  1.235051  1.189860
41  0.672252  0.825093  2.612137 -0.303623  1.287577  0.628966  0.563383
42 -0.298804  0.831495 -0.963744 -2.115642  0.958484 -0.919709  1.051428
43 -0.288059 -1.563655 -1.080405  0.230225 -0.672584 -0.965885 -1.325094
44 -0.615896 -0.461302 -0.054737 -0.401902 -0.037852  0.817290  3.286777
45  0.883390  1.921117  0.598333 -1.940499 -0.317387  2.042051 -1.759447
46 -1.728279 -1.040196 -0.126839 -0.868678 -0.095982 -0.870873 -1.433044
47 -0.313577  1.163784  1.364883 -0.250462 -2.259335 -1.581352 -2.871742
48 -0.770916 -1.377605 -0.099531  0.972476  0.906962 -0.518867  0.711484
49 -0.102851 -0.897452 -1.076660 -0.957398  1.312809  0.403220  1.166469

In [47]:
df.head()

          0         1         2         3         4         5         6
0 -0.102776 -0.918924  0.276567 -0.558351  1.155147  0.860235  0.518951
1  0.058367  0.344438 -0.963842 -2.338285  1.266982 -1.496682 -0.825698
2 -0.900878  0.489925 -0.497601 -0.124297  0.990624  2.944979  1.555461
3  0.151219  2.022263  0.758591  1.635999 -0.915156  1.032121 -0.357196
4 -1.052571 -0.958884 -0.595212  1.428770  0.460333 -0.234220 -1.156503